/*

1) Створіть дві змінні a та b. Виведіть у консоль результат їх множення.

2) Створіть дві змінні c та d. Виведіть у консоль результат ділення першого на друге.

3) Створіть дві змінні e та f. Виведіть у консоль результат додавання.

4) Визначте змінні зі значеннями 11, true, "java script", "100" і виведіть їх в консоль

5) *Переробіть наведений код так, щоб у ньому використовувалися операції +=, -=, *=, /=, ++, --
let num = 1;
num = num + 11;
num = num – 11;
num = num * 11;
num = num / 11;
num = num + 1;
num = num – 1;


*/

// 1), 2), 3)

// оглашаем переменные
const a = 5;
const b = 5;
const c = 5;
const d = 5;
const e = 5;
const f = 5;

// выводим результат
console.log("1)", a * b, "2)", c / d, "3)", e + f);

// 4) оглашаем для удобства список и проверяем тип кажкого из елементов
const list = [11, true, "java script", "100"];

console.log(
  "4)",
  "11 :",
  typeof list[0],
  "/ true  :",
  typeof list[1],
  '/ "java script"  :',
  typeof list[2],
  '/ "100"  :',
  typeof list[3]
);
// 5)

let num = 1;
num += 11;
num -= 11;
num *= 11;
num /= 11;
num = ++num; // num += 1
num = --num;

/* 
Завдання на введення/виведення (вводити з допомогою prompt, виводити з допомогою alert або console.log або на сторінку):

1) Запитати число у користувача, піднести його до квадрату і вивести результат.

2) Вивести середнє арифметичне двох чисел. Числа запитувати у користувача.

3) Перевести кількість хвилин на секунди та вивести результат. Число хвилин запитувати у користувача. 

4) Створіть змінну greeting зі значенням 'Hello,' і оголосіть змінну userName. Запитайте ім'я користувача та внесіть це значення у змінну userName. Виведіть повідомлення з привітанням, наприклад, 'Hello, Vasya!'. (згадайте про конкатенацію). *Додайте в розмітку отриманий рядок в елемент p.
*/

// 1)
console.log(
  "1) число для піднесення до квадруту",
  Number(prompt("Введіть число для піднесення до квадруту", 1)) ** 2
);

// 2)
console.log(
  "2) Вивести середнє арифметичне двох чисел",
  (Number(prompt("Перше число", 2)) + Number(prompt("Друге число", 10))) / 2
);

// 3)
console.log(
  "3) Перевести кількість хвилин на секунди та вивести результат. :",
  Number(prompt("Кількість хвилин", 15)) * 60,
  "кількість секунд"
);

// 4)
const greeting = "Hello, ";

let userName = String(prompt("Введіть імья", "Name"));

document.write("<p>", greeting + userName, "! </p>");
// or document.write("<p>", greeting, "'some text'", userName, "! </p>");
