/*

Зверстати адаптивну форму використовуючи flex (вирівняти поля введення по лівому та правому краям).

Валідність/невалідність введених даних візуалізувати за допомогою псевдокласів :valid, :invalid.

Коректність введених даних перевіряти за допомогою атрибутів pattern, min/maxlength та вбудованої валідації для email.

Випадаючий список реалізувати select`ом (https://developer.mozilla.org/ru/docs/Web/HTML/Element/select).

Для message використовувати textarea (https://developer.mozilla.org/en-US/docs/Web/HTML/Element/textarea).


*Реалізувати обробник на submit форми, в якому значення всіх полів форми запакувати у відповідні поля нового об'єкта (name, email, phone, subject, message). Номер телефону поєднати в один рядок. В message прибрати зайві пробіли (прибрати на початку і кінці; замінити кілька пробілів, що йдуть поспіль, на один).


Приклад макету наведено у вкладеннях. За бажанням можна обрати інший

*/
